# Parameters
nc: 6  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]d
  [[-1, 1, Buffer_Pool, [16]],         # 0   -P1/2
   [0, 1, EPEncoder, [512]],     # 1  -P1/2  4   6   9                     256 64 64
   [0, 1, Pretreatment, [64, 6, 2, 2]],  # 2
   [-1, 1, Conv, [128, 3, 2]],    # 3    -P2/4                               64  64 64
   [[-1, 1], 1, PWE, [1]],  #4     cat backbone P4 1 64  64 64
   [-1, 6, MRF_Mamba1, [128]],                   #5
   [-1, 1, Conv, [256, 3, 2]],           #6    3-P3/8  64(320)  128  32  32         128 32  32
   [[-1, 1], 1, PWE2, [1]], #7    cat backbone P4 1 64  64 64
   [-1, 6, MRF_Mamba2, [256]],                   #8      128   /
   [-1, 1, RS_Mapping1, [256]],               #9
   [8, 1, Conv, [512, 3, 2]],           #10  -P4/16                              256  16  16
   [[-1, 1], 1, PWE3, [1]], #11    cat backbone P4 1 64  64 64
   [-1, 9, MRF_Mamba3, [512]],                   #12     256   /
   [-1, 1, RS_Mapping2, [512]],               #13
   [12, 1, Conv, [1024, 3, 2]],          #14      7-P5/32                             512  8   8
   [[-1, 1], 1, PWE4, [1]], #15     cat backbone P4 1 64  64 64
   [-1, 3, MRF_Mamba4, [1024]],                  #16
   [-1, 1, SPPF, [1024, 5]],             #17 9  512   /
   [-1, 1, RS_Mapping3, [1024]],              #18
  ]

head:
  [[17, 1, Conv, [512, 1, 1]],  #19
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #20

   [[-1, 9,13,18], 1, DDFA3, [1]],  #21     cat backbone P4
   [-1, 3, MRF_Mamba3, [512, False]],  # 22                                   256  16  16

   [-1, 1, Conv, [256, 1, 1]],   #23
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],   #24

   [[-1, 9,13,18], 1, DDFA4_2, [1]],  #25     cat backbone P4
   [-1, 3, MRF_Mamba2, [256, False]],  # 26 (P3/8-small)                      128  32  32

   [-1, 1, Conv, [256, 3, 2]],   #27

   [[-1, 9,13,18], 1, DDFA4_3, [1]],  #28     cat backbone P4
   [-1, 3, MRF_Mamba3, [512, False]],  # 29 (P4/16-medium)                    256  16 16

   [-1, 1, Conv, [512, 3, 2]],    #30

   [[-1, 9,13,18], 1, DDFA4_4, [1]],  #31     cat head P5                         512  8  8
   [-1, 3, MRF_Mamba44, [1024, False]],  #32    23 (P5/32-large)                    512  8  8

   [[26, 29, 32], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
